import { useEffect } from 'react';

const Faq = () => {
    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);
    
    return (
        <div className='bg-footer max-w-[1440px] m-auto'>
            <div className='flex items-center justify-center bg-black bg-opacity-50'>
                <div className='flex flex-col px-5 bg-opacity-50 py-14 rounded-3xl align-items-center lg:px-28 text-slate-100'>
                    <h1 className='text-2xl font-semibold text-center'>FAQ</h1>
                    <ol className='flex flex-col gap-5 px-5 list-decimal bg-opacity-50 py-14 rounded-3xl align-items-center lg:px-28 text-slate-100'>
                        <li>
                            <strong>Що таке локалізація в іграх?</strong>
                            <ul className='ml-5 list-disc'>
                                <li>
                                    Локалізація в іграх - це процес адаптації
                                    гри для мови та культури конкретної
                                    аудиторії або ринку. Основна мета
                                    локалізації - зробити гру більш зрозумілою,
                                    доступною та прийнятною для гравців з різних
                                    країн та мовних груп. Цей процес включає в
                                    себе кілька ключових елементів: переклад
                                    тексту, озвучення, адаптація графіки,
                                    культурні адаптації, локалізація ігрових
                                    функцій. Локалізація в іграх є важливим
                                    процесом для розширення аудиторії та
                                    забезпечення комфортного ігрового досвіду
                                    для гравців.
                                </li>
                            </ul>
                        </li>
                        <li>
                            <strong>
                                Чому важлива українська локалізація ігор?
                            </strong>
                            <ul className='ml-5 list-disc'>
                                <li>
                                    Українська локалізація дозволяє гравцям з
                                    України насолоджуватися грою на рідній мові,
                                    що підвищує іммерсію та занурення в гру.
                                    Гравці можуть краще відчувати себе частиною
                                    ігрового світу і більше відчувати зв'язок з
                                    персонажами та сюжетом.
                                </li>
                                <li>
                                    Локалізована версія гри робить сюжет,
                                    діалоги та інструкції більш зрозумілими для
                                    гравців, які не володіють англійською або
                                    іншими мовами, на яких гра спочатку була
                                    розроблена. Це дозволяє гравцям
                                    насолоджуватися грою без перешкод.
                                </li>
                                <li>
                                    Локалізація робить гру доступною для тих,
                                    хто не володіє іноземними мовами. Це може
                                    включати в себе молодших гравців, людей з
                                    обмеженими знаннями іноземних мов або тих,
                                    хто вважає рідну мову за найзручніший засіб
                                    спілкування.
                                </li>
                                <li>
                                    Для розробників і видавців ігор українська
                                    локалізація може розширити ринок і підвищити
                                    продажі. За наявності української
                                    локалізації гра стає більш привабливою для
                                    українських гравців, що може призвести до
                                    збільшення прибутків.
                                </li>
                            </ul>
                        </li>
                        <li>
                            <strong>
                                Чому деякі ігри не мають української
                                локалізації?
                            </strong>
                            <ul className='ml-5 list-disc'>
                                <li>
                                    Локалізація включає в себе переклад текстів,
                                    адаптацію графіки, озвучення та інші зміни,
                                    щоб гра стала доступною і зрозумілою для
                                    аудиторії, яка говорить на цій мові. Це може
                                    бути дуже часо- та ресурсозатратним
                                    процесом, особливо для великих ігор з
                                    обширними текстовими та аудіовізуальними
                                    елементами.
                                </li>
                                <li>
                                    Деякі ігри можуть мати технічні обмеження,
                                    які ускладнюють або унеможливлюють
                                    локалізацію для інших мов. Наприклад,
                                    неможливість замінити певні шрифти або
                                    аудіофайли, які використовуються у грі.
                                </li>
                                <li>
                                    Локалізація є додатковими витратами для
                                    розробників, і їх може не бути в змозі
                                    фінансувати, особливо в разі менших команд
                                    або незалежних розробників. У будь-якому
                                    випадку, відсутність української локалізації
                                    може бути результатом різних факторів, і
                                    вирішення включити її в ігру залежить від
                                    розробників, видавців та попиту споживачів.
                                </li>
                            </ul>
                        </li>
                        <li>
                            <strong>
                                Як зв'язатися з командою сайту для запитань або
                                пропозицій ігор?
                            </strong>
                            <ul className='ml-5 list-disc'>
                                <li>
                                    Контактна пошта для спілкування з
                                    адміністрацією сайту - jackal3166@gmail.com.
                                </li>
                                <li>
                                    Контактний телеграм для спілкування з
                                    адміністрацією сайту - @jackal3156.
                                </li>
                            </ul>
                        </li>
                    </ol>
                </div>
            </div>
        </div>
    );
};

export default Faq;
